external/wsdl/pl/gov/msw/srp/v3_0/uslugi/pesel/Wyszukiwanie.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="Wyszukiwanie" targetNamespace="http://msw.gov.pl/srp/v3_0/uslugi/pesel/Wyszukiwanie/"
                  xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
                  xmlns:tns="http://msw.gov.pl/srp/v3_0/uslugi/pesel/Wyszukiwanie/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsdl_1="http://msw.gov.pl/srp/v3_0/uslugi/pesel/"
                  xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                  xmlns:wsp="http://www.w3.org/ns/ws-policy"
                  xmlns:sp="http://schemas.xmlsoap.org/ws/2005/07/securitypolicy">
  <wsdl:import location="interfejsy/wyszukiwanie.wsdl" namespace="http://msw.gov.pl/srp/v3_0/uslugi/pesel/"/>
  <wsdl:binding name="PeselWyszukiwanieBinding" type="wsdl_1:PeselWyszukiwanie">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="wyszukajOsoby">
      <soap:operation soapAction="http://msw.gov.pl/srp/v3_0/uslugi/pesel/Wyszukiwanie/wyszukajOsoby/"/>
      <wsdl:input>
        <soap:body parts="parameters" use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body parts="parameters" use="literal"/>
      </wsdl:output>
      <wsdl:fault name="bladBiznesowyFault">
        <soap:fault name="bladBiznesowyFault" use="literal"/>
      </wsdl:fault>
      <wsdl:fault name="bladTechnicznyFault">
        <soap:fault name="bladTechnicznyFault" use="literal"/>
      </wsdl:fault>
    </wsdl:operation>

    <wsdl:operation name="wyszukajPodstawoweDaneOsoby">
      <soap:operation soapAction="http://msw.gov.pl/srp/v3_0/uslugi/pesel/Wyszukiwanie/wyszukajOsoby/"/>
      <wsdl:input>
        <soap:body parts="parameters" use="literal"/>
      </wsdl:input>
      <wsdl:output>
        <soap:body parts="parameters" use="literal"/>
      </wsdl:output>
      <wsdl:fault name="bladBiznesowyFault">
        <soap:fault name="bladBiznesowyFault" use="literal"/>
      </wsdl:fault>
      <wsdl:fault name="bladTechnicznyFault">
        <soap:fault name="bladTechnicznyFault" use="literal"/>
      </wsdl:fault>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="PeselWyszukiwanie">
    <wsdl:port binding="tns:PeselWyszukiwanieBinding" name="PeselWyszukiwaniePort">
      <soap:address location="http://msw.gov.pl/srp/v3_0/uslugi/pesel/Wyszukiwanie/PeselWyszukiwanie/PeselWyszukiwaniePort"/>
    </wsdl:port>
  </wsdl:service>

</wsdl:definitions>